{
  "backend/main.mo": "Main Motoko actor defining Product and SaleTransaction types with CRUD operations for products and sales recording, storing data in Maps keyed by SKU and transaction date, with migration support.",
  "backend/migration.mo": "Migration module that transforms old product and sale data structures (wholesalePrice, retailPrice, price, totalAmount) to new structures with \"Pees\" suffix (wholesalePricePees, retailPricePees, priceInPees, totalAmountPees) for currency precision.",
  "feature_evidence.json": "Feature evidence report documenting that currency display changes to Ghana Cedis (GH₵) are implemented across six frontend components with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files showing that currency formatting in Ghana Cedis (GH₵) is implemented across dashboard metrics, product forms, sales forms, and transaction displays with proper pesewas-to-Cedis conversion.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH-based color system with warm professional palette (browns, tans, warm grays, amber accents) for light and dark modes.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title \"Eleazar Jireh Enterprise\", root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for Dashboard (/), Products (/products), and Sales (/sales) pages, wrapped in Layout with Toaster for notifications.",
  "frontend/src/components/DeleteProductDialog.tsx": "AlertDialog component for confirming product deletion with product name/SKU display, using useDeleteProduct mutation hook with toast notifications.",
  "frontend/src/components/Header.tsx": "Sticky header with Eleazar Jireh Enterprise branding, logo, subtitle, and navigation buttons for Dashboard, Products, and Sales with active state highlighting.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing Header, main content area with Outlet for route rendering, and footer with copyright and caffeine.ai attribution link.",
  "frontend/src/components/LowStockAlerts.tsx": "Card component displaying products with quantity below 10 in a scrollable list with amber warning styling, showing product name, SKU, category, and remaining stock.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component for displaying business metrics with title, value, optional description, icon, and variant-based color coding (default, success, warning, error).",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for SKU, name, category, prices (wholesale/retail), stock quantity, and description. Handles form submission via mutations and displays success/error toasts.",
  "frontend/src/components/ProductTable.tsx": "Table component displaying product list with columns for SKU, name, category, prices, and stock levels. Provides edit and delete action buttons for each product row.",
  "frontend/src/components/RecentTransactions.tsx": "Card component showing a scrollable list of recent sale transactions with customer type badges, timestamps, item counts, and total amounts. Displays empty state when no transactions exist.",
  "frontend/src/components/SaleForm.tsx": "Form for recording sales with customer type selection (wholesale/retail), dynamic line items for products and quantities, and automatic total calculation. Submits sale data via mutation and resets form on success.",
  "frontend/src/components/TransactionHistory.tsx": "Card component displaying filterable transaction history with dropdown to filter by customer type (all/wholesale/retail). Shows sorted transactions with detailed product breakdowns.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing the backend actor instance based on Internet Identity authentication state. Creates anonymous or authenticated actors and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useDashboardMetrics.ts": "Custom hook computing dashboard metrics from products and sales data, including total inventory value, low stock alerts, wholesale/retail sales totals, and recent transactions list.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for product and sales operations (CRUD for products, recording sales, fetching data) using the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm brown/amber color palette for light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying business metrics (inventory value, product count, sales), recent transactions, and low stock alerts with loading skeletons.",
  "frontend/src/pages/ProductsPage.tsx": "Products management page with table view, add/edit dialog form, and delete confirmation for managing inventory catalog.",
  "frontend/src/pages/SalesPage.tsx": "Sales page with a form for recording new wholesale/retail transactions and a transaction history view, refreshing on successful sale.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using OKLCH, typography, container queries, animations, and shadcn/ui design tokens.",
  "project_state.json": "Project state file tracking a wholesale/retail shop management application for 'Eleazar Jireh Enterprise' with inventory, sales, and dashboard features. Includes completed features (product management, sales transactions, dashboard metrics) and pending requests for color scheme updates and UI improvements using Ghana Cedis currency."
}